app/controllers/users/omniauth_callbacks_controller.rb

	def twitter
		auth_hash = request.env["omniauth.auth"]
		uid = auth_hash['uid']
		name = auth_hash['info']['name']
		auth = Authorization.find_by_provider_and_uid("twitter", uid)
		if auth
			## We already know about this user who is signing in with
			# the provider: just return the user associated with th Authorization
			user = auth.user
		else
			## Is a user signed in already? If onot, then find or create
			# the user
			unless current_user
				unless user = User.find_by_name(name)
					user = User.create({
						name: name,
						password: Devise.friendly_token[0,8],
						email: "#{UUIDTools::UUID.random_create}@shareup.com"
						})
				end
			else
				user = current_user
			end

			## Finally, create an authorization for the current user
			unless auth = user.authorizations.find_by_provider("twitter")
				auth = user.authorizations.build(provider: "twitter", uid: uid)
				user.authorizations << auth
---
SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = 'twitter' AND "authorizations"."uid" = '1480514228' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."name" = 'Awkin.co' LIMIT 1
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."user_id" = ? AND "authorizations"."provider" = 'twitter' LIMIT 1  [["user_id", 1]]
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 04 Oct 2013 20:58:28 UTC +00:00], ["provider", "twitter"], ["uid", "1480514228"], ["updated_at", Fri, 04 Oct 2013 20:58:28 UTC +00:00], ["user_id", 1]]